cfg/DataProcessors/ОбновлениеИнформационнойБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ОбновлениеИнформационнойБазы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cfg/InformationRegisters/ВзносыВФондыРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ВзносыВФондыРаботниковОрганизаций</Name>
			<Comment>(Регл) Начало действия взноса начало дня, окончание взноса - конец дня</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ВидыДействияСНачислением.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДействияСНачислением</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начать</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИзменять</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прекратить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Documents/ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<BasedOn>
				<xr:Item>Catalog.СотрудникиОрганизаций</xr:Item>
				<xr:Item>Document.ДоговорНаВыполнениеРаботСФизЛицом</xr:Item>
				<xr:Item>Document.НачислениеПоБольничномуЛисту</xr:Item>
				<xr:Item>Document.ОплатаПоСреднемуЗаработку</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеНачисленияРаботниковОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ВзносыВФондыРаботниковОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
								<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДействияКонец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта6</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд6</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьДополнительныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
								<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.УдалитьДополнительныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Взносы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВзносыФОТ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/DataProcessors/ОбновлениеИнформационнойБазы/Forms/ФормаПереходЕСВ2016/Ext/Form/Module.bsl
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ДокументОбъект = Документы.ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.СоздатьДокумент();
	ДокументОбъект.Дата = Период;
	ДокументОбъект.Комментарий = НСтр("ru='Переход на отчет по ЕСВ 2016 г.';uk='Перехід на звіт з ЄСВ 2016 р.'");   
	ДокументОбъект.Организация = Организация; 
	ДокументОбъект.УстановитьНовыйНомер();
	
	ТаблицаВзносов = Взносы.Скопировать();
	ТаблицаВзносов.Колонки.Добавить("Налог");
	ТаблицаВзносов.Колонки.Добавить("Действие");
	ТаблицаВзносов.Колонки.Добавить("ДатаДействия");
	
	ТаблицаВзносов.ЗагрузитьКолонку(ТаблицаВзносов.ВыгрузитьКолонку("Прекратить"),"Налог");
	ТаблицаВзносов.ЗаполнитьЗначения(Перечисления.ВидыДействияСНачислением.Прекратить,"Действие");
	ТаблицаВзносов.ЗаполнитьЗначения(Период - 60*60*24,"ДатаДействия");
	
	ТаблицаВзносовФОТ = Новый ТаблицаЗначений;
	ТаблицаВзносовФОТ.Колонки.Добавить("Сотрудник");
	ТаблицаВзносовФОТ.Колонки.Добавить("Налог");
	ТаблицаВзносовФОТ.Колонки.Добавить("Действие");
	ТаблицаВзносовФОТ.Колонки.Добавить("ДатаДействия");
	
	Для Каждого СтрокаТаблицы Из ВзносыФОТ Цикл
		НС = ТаблицаВзносовФОТ.Добавить();	
		НС.Сотрудник = СтрокаТаблицы.Сотрудник;
		НС.ДатаДействия = Период - 60*60*24;
		НС.Налог = СтрокаТаблицы.Прекратить;
		НС.Действие = Перечисления.ВидыДействияСНачислением.Прекратить;
		НС = ТаблицаВзносовФОТ.Добавить();	
		НС.Сотрудник = СтрокаТаблицы.Сотрудник;
		НС.ДатаДействия = Период;
		НС.Налог = СтрокаТаблицы.Начать;
		НС.Действие = Перечисления.ВидыДействияСНачислением.Начать;
	КонецЦикла;	
	
	ДокументОбъект.Взносы.Загрузить(ТаблицаВзносов);
	ДокументОбъект.ВзносыФОТ.Загрузить(ТаблицаВзносовФОТ);
	ДокументОбъект.ПолучитьФорму().Открыть();
КонецПроцедуры

Процедура ПриОткрытии()
	
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяОрганизация");
	Период = Дата(2016,6,1);

	
КонецПроцедуры

Процедура ЗаполнитьНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сообщить(НСтр("ru='Не указана организация!';uk='Не зазначена організація!'"), СтатусСообщения.Важное);
		Возврат		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Сообщить(НСтр("ru='Не указан период!';uk='Не зазначений період!'"), СтатусСообщения.Важное);
		Возврат		
	КонецЕсли;	
	
	Взносы.Очистить();
	ВзносыФот.Очистить();
		
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Взносы", Справочники.Налоги.Взносы);
	Запрос.УстановитьПараметр("ВзносыФОТ", Справочники.Налоги.ВзносыФОТ);
	
	СписокВзносов = Новый Массив;
	СписокВзносов.Добавить(Справочники.Налоги.ЕСВРаботникиСР);
	СписокВзносов.Добавить(Справочники.Налоги.ЕСВМобилизованные);
	СписокВзносов.Добавить(Справочники.Налоги.ЕСВГПХ);
	Запрос.УстановитьПараметр("ЗаменяемыеВзносы", СписокВзносов);
	
	СписокВзносовФОТ = Новый Массив;
	СписокВзносовФОТ.Добавить(Справочники.Налоги.ЕСВФОТИнвалиды);
	СписокВзносовФОТ.Добавить(Справочники.Налоги.ЕСВФОТРаботники);
	СписокВзносовФОТ.Добавить(Справочники.Налоги.ЕСВФОТГПХСудостр);
	СписокВзносовФОТ.Добавить(Справочники.Налоги.ЕСВФОТСудостр);

	Запрос.УстановитьПараметр("ЗаменяемыеВзносыФОТ", СписокВзносовФОТ);

	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	               |	ВзносыВФонды.Налог.Родитель КАК Родитель,
				   |	ВзносыВФонды.Налог,
	               |	ВзносыВФонды.Сотрудник
				   |ПОМЕСТИТЬ ВТВсеВзносы
				   |ИЗ
	               |	РегистрСведений.ВзносыВФондыРаботниковОрганизаций.СрезПоследних(&Период, Организация = &Организация И Налог.Актуальность) КАК ВзносыВФонды
				   |ГДЕ 
				   |	ВзносыВФонды.Актуальность
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Сотрудник,Налог
				   |;
				   |
				   |ВЫБРАТЬ
	               |	ВзносыВФонды.Налог,
	               |	ВзносыВФонды.Сотрудник
				   |ПОМЕСТИТЬ ВТВзносы
				   |ИЗ
	               |	ВТВсеВзносы КАК ВзносыВФонды
				   |ГДЕ
				   |	ВзносыВФонды.Родитель = &Взносы 
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Сотрудник,Налог
				   |;
				   |
				   |ВЫБРАТЬ
	               |	Взносы.Налог КАК Прекратить,
	               |	Взносы.Сотрудник КАК Сотрудник
				   |ИЗ ВТВзносы КАК Взносы
				   |УПОРЯДОЧИТЬ ПО
				   |	Сотрудник.Наименование,Налог.Наименование
				   |";
	Взносы = Запрос.Выполнить().Выгрузить();
			   
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзносыВФонды.Налог,
	               |	ВзносыВФонды.Сотрудник
				   |ПОМЕСТИТЬ ВТВзносыФОТ
				   |ИЗ
	               |	ВТВсеВзносы КАК ВзносыВФонды
				   |ГДЕ
				   |	ВзносыВФонды.Родитель = &ВзносыФОТ
				   |	И ВзносыВФонды.Налог В (&ЗаменяемыеВзносыФОТ)
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Сотрудник,Налог
			   	   |;
				   |
				   |ВЫБРАТЬ
	               |	ВзносыФОТ.Налог КАК Прекратить,
				   |    ВЫБОР
				   |    	КОГДА Взносы.Налог = ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВМобилизованные) 
				   |         ТОГДА ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВФОТМобил)
				   |    	КОГДА Взносы.Налог = ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВРаботникиСР) И ВзносыФОТ.Налог = ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВФОТРаботники)
				   |         ТОГДА ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВФОТРаботникиСР)
				   |    	КОГДА Взносы.Налог = ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВРаботникиСР) И ВзносыФОТ.Налог = ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВФОТИнвалиды)
				   |         ТОГДА ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВФОТИнвалидыСР)
				   |    	КОГДА ВзносыФОТ.Налог = ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВФОТГПХСудостр) 
				   |         ТОГДА ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВФОТГПХ)
				   |    	КОГДА ВзносыФОТ.Налог = ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВФОТСудостр) 
				   |         ТОГДА ЗНАЧЕНИЕ(Справочник.Налоги.ЕСВФОТРаботники)
				   |    КОНЕЦ КАК Начать,
	               |	Взносы.Сотрудник
				   |ПОМЕСТИТЬ ВТЗамены
				   |ИЗ
	               |	ВТВзносы КАК Взносы
	               |ЛЕВОЕ СОЕДИНЕНИЕ 
				   |	ВТВзносыФОТ КАК ВзносыФОТ
				   |ПО
				   |	Взносы.Сотрудник = ВзносыФОТ.Сотрудник
				   |ГДЕ
				   |	Взносы.Налог В (&ЗаменяемыеВзносы)
				   |;
				   |
				   |ВЫБРАТЬ
	               |	Замены.Прекратить,
				   |    Замены.Начать,
	               |	Замены.Сотрудник
				   |ИЗ
	               |	ВТЗамены КАК Замены
				   |ГДЕ
				   |	НЕ Замены.Прекратить ЕСТЬ NULL
				   |	И НЕ Замены.Начать ЕСТЬ NULL";
	ВзносыФОТ = Запрос.Выполнить().Выгрузить();
	ТаблицаЗамен = ВзносыФОТ.Скопировать(,"Прекратить");
 
	
КонецПроцедуры
